public/posts/hello-world/index.html
<!DOCTYPE html>
<html lang="en-us" dir="ltr">
<head>  <head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width", initial-scale=1>
  
    <link type="text/css" rel="stylesheet" href="/css/main.css">

  <link href="https://unpkg.com/tailwindcss@^1.0/dist/tailwind.min.css" rel="stylesheet">
  
  
  <title>0xV34L | Hello World </title>
</head>

</head>
<body>
  <header>
    <header class="site-header">
  <div id="nav-border" class="container header-container rounded-container">
    <div class="header-content">
      <div>
        <h1 class="site-title">0xV34L</h1>
      </div>
      <nav id="nav" class="nav-menu">
        
      </nav>
    </div>
  </div>
</header>

  </header>
  <main>
    
<div class="postTitle">
  <h1>Hello World</h1>

  
  
  <time datetime="2023-11-15T00:00:00&#43;00:00">November 15, 2023</time>
</div>
  
<p>
For this first post, I&#39;d like to introduce myself and provide some context into my background.</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Using Linux
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<ul>
<li>2017</li>
</ul>
<p>My Linux journey started in the middle of highschool, when I first started using Tails as a way to be more private while browsing with Tor. As a first exposure to Linux, it was pretty positive and I didn&#39;t experience any friction trying to do the things I wanted to do.</p>
<p>
I, however, had no intention of daily driving a Linux distro since I was worried I wouldn&#39;t be able to play my favourite online games, so a full install would have to wait a couple of years.</p>
<ul>
<li>2020</li>
</ul>
<p>It wasnt until 2020 that I installed my first <em>real</em> distro : <strong>Ubuntu</strong>.
After the family 2009 iMac started slowing down significantly, I decided to boot Ubuntu on it to try to extend it&#39;s lifespan. This is also when I started learning about Linux at school, which further motivated me to start using it at home.</p>
<p>
I remember having a lot of trouble installing packages, being confused about why sometimes I had to install via the terminal, and other times by downloading app images from the web directly.</p>
</div>
</div>

  


  </main>
  <footer>
    <p class="footer text-center"> Last Updated on 2025 Aug 10 4:34 PM | Made by V34L | Powered by HUGO</p>

  </footer>
</body>
</html>
